wmsmobile/src/Documents/униНаборкаАгрегация/униНаборкаАгрегация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>униНаборкаАгрегация</name>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТТНЕГАИС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>81</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>199</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодификаторТабХЗ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>КодификаторПолучен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакТ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыборкаДанныхПоАгрегации</name>
    <attributes>
      <name>КодМарки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>199</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодКороба</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>199</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодПалеты</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РФУ2</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>КодАП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>55</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеНоменклатуры</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>199</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРозлива</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоБУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоНабрано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Наборка</name>
    <attributes>
      <name>КодЭлементаУчета</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодКороба</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодФСМ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонтрольПоЭлементам</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

wmsmobile/src/Documents/униНаборкаАгрегация/ObjectModule.bsl
Процедура ПроверитьНаборкуНаСервере() Экспорт
	ФСтр = "";
	Для каждого Тек Из Наборка Цикл
		Если ПустаяСтрока(Тек.КодЭлементаУчета) Тогда
			
			продолжить;
			
		КонецЕсли; 
		Если униОбщийМодуль.ОпрределитьТипСчитанногоШК(Тек.КодЭлементаУчета) = "Прочий" Тогда
			
			Продолжить;
			
		КонецЕсли; 
		Фстр = Фстр + ?(ПустаяСтрока(Фстр),"",Символы.ПС)+тек.КодЭлементаУчета;
	КонецЦикла; 
	
	СтруктураЗапроса = униОбщийМодуль.НоваяСтруктураЗапросакUWS();
	СтруктураЗапроса.Вставить("КодыНаборки",Фстр);
	
	СтруктураЗапроса.Вставить("ИмяМетода","ПолучитьДанныеНаборки");
	СтруктураЗапроса.Вставить("ГУИД",ТТНЕГАИС);
	
	Попытка
		ОтветСервера =  униОбщийМодуль.ДанныеИзUWS(СтруктураЗапроса);
	Исключение
		УспехАвторизации = Ложь;
		ОтветСервера = "Ошибка";
	КонецПопытки; 
	
	Если ТипЗнч(ОтветСервера) = Тип("Структура") Тогда
		Если ОтветСервера.Свойство("Товары") Тогда
			
			Товары.Загрузить(ОтветСервера.Товары);
			
		КонецЕсли; 
		Если ОтветСервера.Свойство("Наборка") Тогда
			
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Наборка.Идентификатор КАК Идентификатор,
			|	Наборка.Количество КАК Количество
			|ПОМЕСТИТЬ Т1
			|ИЗ
			|	&Наборка КАК Наборка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	НаборкаЛокально.КодЭлементаУчета КАК КодЭлементаУчета,
			|	НаборкаЛокально.Количество КАК Количество,
			|	НаборкаЛокально.КодКороба КАК КодКороба,
			|	НаборкаЛокально.КодФСМ КАК КодФСМ,
			|	НаборкаЛокально.КонтрольПоЭлементам КАК КонтрольПоЭлементам
			|ПОМЕСТИТЬ Т2
			|ИЗ
			|	&НаборкаЛокально КАК НаборкаЛокально
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Т2.КодЭлементаУчета КАК КодЭлементаУчета,
			|	ЕСТЬNULL(Т1.Количество, 0) КАК Количество,
			|	Т2.КодКороба КАК КодКороба,
			|	Т2.КодФСМ КАК КодФСМ,
			|	Т2.КонтрольПоЭлементам КАК КонтрольПоЭлементам
			|ИЗ
			|	Т2 КАК Т2
			|		ЛЕВОЕ СОЕДИНЕНИЕ Т1 КАК Т1
			|		ПО Т2.КодЭлементаУчета = Т1.Идентификатор";
			
			Запрос.УстановитьПараметр("Наборка",ОтветСервера.Наборка);
			Запрос.УстановитьПараметр("НаборкаЛокально",Наборка.Выгрузить());
			РезультатЗапроса = Запрос.Выполнить();
			
			
			
			Наборка.Загрузить(РезультатЗапроса.Выгрузить());
			
		КонецЕсли; 
		КодификаторТАбДок ="";
		СвойствоКодификатораЕсть =  ОтветСервера.Свойство("Кодификатор",КодификаторТАбДок);
		Если СвойствоКодификатораЕсть Тогда
			КодификаторТабХЗ = Новый ХранилищеЗначения(КодификаторТАбДок);	
			Если КодификаторТАбДок.ВысотаТаблицы > 0 Тогда
				
				КодификаторПолучен = Истина;
				Записать();
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли;
КонецПроцедуры

 


Процедура ВыгрузитьНаборкуНаСервере(СообщениеО)  Экспорт
	ФСтр = "";
	Для каждого Тек Из Наборка Цикл
		Если ПустаяСтрока(Тек.КодЭлементаУчета) Тогда
			
			продолжить;
			
		КонецЕсли; 
		Если униОбщийМодуль.ОпрределитьТипСчитанногоШК(Тек.КодЭлементаУчета) = "Прочий" Тогда
			Продолжить;
		КонецЕсли; 
		Фстр = Фстр + ?(ПустаяСтрока(Фстр),"",Символы.ПС)+тек.КодЭлементаУчета;
	КонецЦикла; 
	СтруктураЗапроса = униОбщийМодуль.НоваяСтруктураЗапросакUWS();
	СтруктураЗапроса.Вставить("КодыНаборки",Фстр);
	СтруктураЗапроса.Вставить("УИД",Ссылка.УникальныйИдентификатор());
	СтруктураЗапроса.Вставить("КодыМасивом",Наборка.ВыгрузитьКолонку("КодЭлементаУчета"));
	СтруктураЗапроса.Вставить("ИмяМетода","ВыгрузитьДанныеНаборки");
	СтруктураЗапроса.Вставить("Автор",ПараметрыСеанса.ТекущийПользовательУИД);
	СтруктураЗапроса.Вставить("ГУИД",ТТНЕГАИС);
	
	Попытка
		ОтветСервера =  униОбщийМодуль.ДанныеИзUWS(СтруктураЗапроса);
	Исключение
		УспехАвторизации = Ложь;
		ОтветСервера = "Ошибка";
	КонецПопытки; 
	
	Если ТипЗнч(ОтветСервера) = Тип("Структура") Тогда
		Если ОтветСервера.Свойство("ОтветРезультат") Тогда
			СообщениеО = ОтветСервера.ОтветРезультат;
		КонецЕсли; 
	КонецЕсли;
КонецПроцедуры

Функция ТабДокСервере() Экспорт

	  Возврат  КодификаторТабХЗ.Получить();

КонецФункции
